{"suic_mg": {"question": "In your judgement, what is the risk that the person will attempt suicide?", "values": "scale"}, "sui-specific_mg": {"question": "Do you have reason to be concerned about the person's risk of suicide?", "values": "layer"}, "suic-past-att_mg": {"question": "Has the person ever made a suicide attempt? If yes, the questions about them should be answered with reference to the attempts in general rather than any specific one, unless otherwise stated.", "values": "filter-q"}, "suic-most-rec_mg": {"question": "When was the most recent suicide attempt?", "values": "date-week"}, "suic-patt-att_mg": {"question": "Has there been more than one suicide attempt?", "values": "filter-q"}, "suic-first-occ_mg": {"question": "When was the first suicide attempt?", "values": "date-week"}, "suic-escalate_mg": {"question": "How have the suicide attempts been changing in frequency over the last two years?", "values": "nominal"}, "suic-how-many_mg": {"question": "Approximately how many suicide attempts have there been?", "values": "integer"}, "suic-note-prev_mg": {"question": "Was a suicide note written for any previous or current suicide attempts?", "values": "nominal"}, "suic-discovery_mg": {"question": "Did the person try to hide any suicide attempt, to make sure it was not stopped?", "values": "scale"}, "suic-lethality_mg": {"question": "How lethal was the most serious method used by the person in any of the suicide attempts (i.e. how likely to succeed in killing the person without any intervention)?", "values": "scale"}, "suic-ser-succd_mg": {"question": "Do you believe the person wanted the suicide attempts to succeed at the time?", "values": "scale"}, "suic-regret_mg": {"question": "How much does the person fail to show any regret or remorse over having tried to complete suicide in the past?", "values": "scale"}, "suic-leth-insght_mg": {"question": "Does the person lack awareness about how dangerous the suicide attempts were?", "values": "scale"}, "suic-curr-int_mg": {"question": "Do you have reason to be concerned about the person's current intention to complete suicide?", "values": "layer"}, "suic-plans_mg": {"question": "Does the person have any plans for making a future suicide attempt?", "values": "filter-q"}, "suic-plan-real_mg": {"question": "Can the person easily carry out the suicide plan (consider realism of plan and access to means of putting it into action)?", "values": "scale"}, "suic-steps-takn_mg": {"question": "Has the person taken steps towards carrying out the suicide plan?", "values": "scale"}, "suic-prosp-leth_mg": {"question": "How likely is the chosen method to succeed?", "values": "scale"}, "suic-int-inform_mg": {"question": "Has the person told anyone about an intention to complete suicide?", "values": "nominal"}, "suic-eol-prep_mg": {"question": "Has the person made unexpected end-of-life preparations that cause you concern about suicide risk (eg written a will, sorted finances, put house in order, written suicide note)?", "values": "scale"}, "suic-s-h-behv_mg": {"question": "Does the person have a pattern of self-harming that indicates suicidal intention?", "values": "scale"}, "suic-rel-belief_mg": {"question": "What effect do the person's spiritual/religious values, beliefs, or attitudes to dying have on risk of suicide?", "values": "nominal"}, "suic-int-p-trig_mg": {"question": "Do you have reason to be concerned about anything that could trigger suicide attempts?", "values": "layer"}, "suic-pot-trig_mg": {"question": "Is the person exposed to feelings or circumstances that may trigger a suicide attempt?", "values": "scale"}, "suic-p-trig-mtch_mg": {"question": "Do the person's current feelings or circumstances match those that are known to have triggered any previous suicide attempts?", "values": "scale"}, "suic-fam-hist_mg": {"question": "Has there been any history of suicide attempts in the person's family?", "values": "nominal"}, "suic-ideation_mg": {"question": "Is the person having suicidal thoughts or fantasies?", "values": "filter-q"}, "suic-id-control_mg": {"question": "Does the person lack ability to control suicidal thoughts or fantasies?", "values": "scale"}, "suic-id-hi-risk_mg": {"question": "Does the content of the suicidal thoughts or fantasies make it more likely the person will attempt suicide?", "values": "scale"}, "suic-id-freq_mg": {"question": "How often do the suicidal thoughts or fantasies occur?", "values": "nominal"}, "suic-id-strngth_mg": {"question": "How persistent, intrusive, or intense are the suicidal thoughts or fantasies?", "values": "scale"}, "gen-sh-cuts_mg": {"question": "Does the person display evidence of recent self-harming injuries?", "values": "scale"}, "sn-appearnce_mg": {"question": "Is the person showing signs of self-neglect?", "values": "filter-q"}, "sn-hair-clothes_mg": {"question": "Do the person's hair and clothing indicate self-neglect?", "values": "scale"}, "sn-hygiene_mg": {"question": "Does the person have poor personal hygiene (eg smell, dirty hair and nails)?", "values": "scale"}, "sn-recnt-app-chnge_mg": {"question": "Has there been a recent change in appearance suggestive of self-neglect?", "values": "scale"}, "sn-skin_mg": {"question": "To what extent does the person's skin (condition, lesions, injuries, etc) indicate self-neglect?", "values": "scale"}, "gen-feel-emot_mg": {"question": "Do you have reason to be concerned about risks due to the person's feelings/emotions?", "values": "layer"}, "gen-mood-swings_mg": {"question": "Does the person have sudden mood changes or swings?", "values": "scale"}, "gen-negative-self_mg": {"question": "Does the person have negative feelings about him or herself (eg self-hatred, guilt, shame, humiliation)?", "values": "scale"}, "gen-plans-future_mg": {"question": "Does the person lack any plans for the future?", "values": "scale"}, "gen-life-not-livng_mg": {"question": "Does the person think life is not worth living?", "values": "scale"}, "gen-angry-emotns_mg": {"question": "Is the person displaying anger?", "values": "scale"}, "gen-anx-emotns_mg": {"question": "Is the person anxious or fearful?", "values": "scale"}, "gen-helpless_mg": {"question": "Does the person feel helpless?", "values": "scale"}, "gen-sad_mg": {"question": "Is the person feeling sad or low?", "values": "scale"}, "gen-distress_mg": {"question": "Is the person distressed?", "values": "scale"}, "gen-jealous_mg": {"question": "Is the person feeling jealous?", "values": "scale"}, "gen-self-worth-p_mg": {"question": "Do you have reason to be concerned about risks due to the person's sense of self worth?", "values": "layer"}, "grandiosity_mg": {"question": "Does the person feel special and able to control everything?", "values": "scale"}, "worthlessness_mg": {"question": "Does the person regard him or herself as worthless?", "values": "scale"}, "gen-personality_mg": {"question": "Do you have reason to be concerned about personality factors and their impact on risks?", "values": "layer"}, "gen-assertive_mg": {"question": "How assertive is the person?", "values": "nominal"}, "gen-empathy-abil_mg": {"question": "Does the person lack empathy?", "values": "scale"}, "gen-dependence_mg": {"question": "Is the person overdependent (weak, over-reliant on others, easily influenced, unable to function independently)?", "values": "scale"}, "gen-controlling_mg": {"question": "How organised is the person's general approach to life?", "values": "nominal"}, "gen-coping-abil_mg": {"question": "Does the person lack the ability to cope with major life stresses?", "values": "scale"}, "gen-hostile_mg": {"question": "How hostile is the person?", "values": "scale"}, "gen-impulse_mg": {"question": "How impulsive is the person?", "values": "scale"}, "gen-reliable_mg": {"question": "How unreliable is the person (eg untrustworthy or unpredictable)?", "values": "scale"}, "gen-pers-dis_mg": {"question": "Does the person have a diagnosed personality disorder?", "values": "nominal"}, "ment-fac_mg": {"question": "Is there any impaired cognitive function (thinking processes, memory, concentration) or dementia?", "values": "filter-q"}, "gen-impaird-cog_mg": {"question": "What is the current level of impaired thinking processes and memory?", "values": "nominal"}, "gen-cog-think-mem_mg": {"question": "Have the thinking processes and memory recently got worse?", "values": "scale"}, "gen-concentr_mg": {"question": "Is the person able to concentrate?", "values": "scale"}, "gen-learn-disab_mg": {"question": "Do you believe the person has learning disabilities?", "values": "nominal"}, "insight-resp_mg": {"question": "Do you have reason to be concerned about the person's lack of insight and sense of responsibility?", "values": "layer"}, "gen-insght-behvr_mg": {"question": "Does the person fail to understand the potential consequences of taking risks?", "values": "scale"}, "gen-resp-impct-oth_mg": {"question": "Does the person lack any sense of responsibility for the outcomes of risk-taking behaviour?", "values": "scale"}, "gen-nd-hlp-diff_mg": {"question": "Does the person lack insight about needing help with mental-health issues?", "values": "scale"}, "mental-health_mg": {"question": "Does the person have any history of depression, mania, hallucinations, or delusions?", "values": "filter-q"}, "clin-depression_mg": {"question": "Has the person ever been diagnosed with clinical depression?", "values": "filter-q"}, "gen-dep-stage_mg": {"question": "Select the most appropriate label for the current depression status?", "values": "nominal"}, "gen-mntl-cur-sympt_mg": {"question": "Is the person currently suffering from mania, hallucinations, or delusions?", "values": "filter-q"}, "gen-mania_mg": {"question": "Is the person displaying manic or hypomanic behaviour (fast speech, excessive irritability, recklessness, impulsivity, etc)?", "values": "scale"}, "gen-voice-hal_mg": {"question": "Does the person hear voices that are not present in reality?", "values": "filter-q"}, "gen-voice-dang-s_mg": {"question": "How much do the voices urge the person to harm or endanger him/herself?", "values": "scale"}, "gen-voice-dang-o_mg": {"question": "How much do the voices urge the person to harm/endanger other people?", "values": "scale"}, "gen-prob-act-voice_mg": {"question": "Will the person act on the voices?", "values": "scale"}, "gen-paranoid-del_mg": {"question": "Does the person suffer from delusions (ie clearly incorrect and illogical ideas about his or her life and circumstances)?", "values": "filter-q"}, "gen-paran-del-spec_mg": {"question": "Is the person obsessed about the perceived bad behaviour of particular known people?", "values": "scale"}, "gen-paran-del-pers_mg": {"question": "Is the person obsessed about being harmed or persecuted by particular known people?", "values": "scale"}, "gen-prob-act-par-del_mg": {"question": "How likely is it that the person will act on any delusions?", "values": "scale"}, "gen-phys-hlth-prb_mg": {"question": "Do you have reason to be concerned about risks due to any physical health problems?", "values": "layer"}, "gen-chronic-disease_mg": {"question": "Does the person suffer from any chronic health conditions? If yes, select all those that apply.", "values": "filter-q"}, "tinnitus_mg": {"question": "Is tinnitus one of the chronic health conditions?", "values": "nominal"}, "diabetes_mg": {"question": "Is diabetes one of the chronic health conditions", "values": "nominal"}, "multiple-sclerosis_mg": {"question": "Is multiple sclerosis one of the chronic health conditions?", "values": "nominal"}, "asthma_mg": {"question": "Is asthma one of the chronic health conditions?", "values": "nominal"}, "heart-disease_mg": {"question": "Is heart disease one of the chronic health conditions?", "values": "nominal"}, "kidney-disease_mg": {"question": "Is kidney disease one of the chronic health conditions?", "values": "nominal"}, "lung-disease_mg": {"question": "Is lung disease one of the chronic health conditions?", "values": "nominal"}, "arthritis_mg": {"question": "Is arthritis one of the chronic health conditions?", "values": "nominal"}, "high-blood-pressure_mg": {"question": "Is high blood pressure one of the chronic health conditions?", "values": "nominal"}, "other_mg": {"question": "Are there any other chronic health conditions?", "values": "nominal"}, "gen-phys-hlth-deg-diag_mg": {"question": "If the person has a life-threatening or degenerative illness (eg cancer, multiple sclerosis, Parkinson's, emphysema, HIV), when was it first diagnosed?", "values": "date-month"}, "gen-phys-hlth-pain_mg": {"question": "If the person suffers from chronic or periodic pain, how bad is it?", "values": "scale"}, "gen-phys-hlth-disa_mg": {"question": "Does the person suffer from problems that affect mobility and/or dexterity (eg eyesight, balance, disability due to disease or trauma)?", "values": "scale"}, "gen-com-imp_mg": {"question": "Does the person have trouble communicating as a result of physical health problems (eg hearing, speech)?", "values": "scale"}, "gen-phys-hlth-det_mg": {"question": "Has the person's physical health got worse over the last few months, including temporary or repeating problems?", "values": "scale"}, "gen-meds-therpy_mg": {"question": "Do you have reason to be concerned about the person's concordance with health treatment?", "values": "layer"}, "gen-meds-concord_mg": {"question": "Is the person failing to concord with medication or therapies, either deliberately or due to multiple medications, for example?", "values": "scale"}, "gen-serv-perc-supp_mg": {"question": "Does the person think health or social care services are not supportive?", "values": "scale"}, "gen-med-perc-benft_mg": {"question": "Does the person and/or carer think any medication/therapies are not working properly?", "values": "scale"}, "motive-eng_mg": {"question": "Do you have reason to be concerned about the person's motivation and engagement with the world?", "values": "layer"}, "gen-phys-withd_mg": {"question": "Is the person physically isolated from the world?", "values": "scale"}, "gen-mental-withd_mg": {"question": "Has the person mentally disengaged or withdrawn from the world?", "values": "scale"}, "gen-motivation_mg": {"question": "Does the person lack motivation in general life?", "values": "scale"}, "gen-listless_mg": {"question": "Does the person appear listless or lacking energy and drives (eg loss of enthusiasm and libido)?", "values": "scale"}, "gen-soc-contxt_mg": {"question": "Do you have reason to be concerned about risks due to the person's social context (relationships, living arrangements, finances, employment, any detrimental changes)?", "values": "layer"}, "gen-relatnshps_mg": {"question": "Do you have reason to be concerned about risks due to the person's current relationships?", "values": "layer"}, "gen-net-relat_mg": {"question": "Does the person lack a good network of relationships outside the home?", "values": "scale"}, "gen-relat-supp_mg": {"question": "Does the person lack supportive relationships?", "values": "scale"}, "gen-relat-detr_mg": {"question": "Does the person have detrimental relationships (eg bullied, over-protected) or ones with people who have antisocial behaviours or who take advantage of the person?", "values": "scale"}, "gen-relat-detr-chg_mg": {"question": "Does the person think important relationships have changed for the worse or soon will do (eg divorce, separation, rows, carer's role, bereavement)?", "values": "scale"}, "gen-living-arr_mg": {"question": "Do you have reason to be concerned about risks due to the person's living arrangements?", "values": "layer"}, "gen-move-freq_mg": {"question": "How often does the person's living place change?", "values": "nominal"}, "gen-accom-loss_mg": {"question": "Has the accommodation recently been taken away from the person or is it under threat of being taken away?", "values": "nominal"}, "gen-home-type_mg": {"question": "What type of supported living does the person have?", "values": "nominal"}, "gen-isol-accom_mg": {"question": "Is the person's accommodation isolated from other living abodes and resources?", "values": "scale"}, "gen-neigbrhd-rsky_mg": {"question": "Does the neighbourhood or care environment increase the person's particular risks (eg violent, easy access to drugs and unhelpful temptations)?", "values": "scale"}, "gen-accom-hm-care_mg": {"question": "Is the person's accommodation showing lack of care?", "values": "scale"}, "gen-accom-habitbl_mg": {"question": "Does the person think the accommodation is unfit to live in?", "values": "scale"}, "gen-finance-empl_mg": {"question": "Do you have reason to be concerned about risks due to the person's employment and/or finances?", "values": "layer"}, "gen-perc-debt-anx_mg": {"question": "How anxious is the person about perceived levels of debt?", "values": "scale"}, "gen-poverty_mg": {"question": "Does the person's income fail to cover the essential living costs of the household (food, rent, heating, etc)?", "values": "scale"}, "gen-job-chg-frq_mg": {"question": "How unstable is the person's employment history (eg always changing, poor disciplinary record)?", "values": "scale"}, "gen-rec-bad-job-ch_mg": {"question": "Does the person believe a recent or potential change in employment is detrimental (eg loss of job, retirement, work stress)?", "values": "scale"}, "gen-currnt-bhvr_mg": {"question": "Do you have reason to be concerned about the person's general current behaviour (eg risk-taking, sleep patterns, daily activities, challenging behaviour)?", "values": "layer"}, "gen-rsk-behavr_mg": {"question": "Does the person take reckless risks (eg with sexual behaviour, driving, gambling and other leisure pursuits)?", "values": "scale"}, "gen-unint-risk-behavr_mg": {"question": "Does the person's behaviour lead to unintentional risks (eg fire or harm due to being careless, thoughtless or forgetful; self-injurious behaviour)?", "values": "scale"}, "gen-sleep-dist_mg": {"question": "Does the person experience problems with sleeping?", "values": "scale"}, "gen-unusl-rec-bhvr_mg": {"question": "Has the person been behaving out of character or unpredictably in recent weeks?", "values": "scale"}, "gen-chall-bhvr_mg": {"question": "Does the person display challenging behaviour (eg antisocial, disruptive, resistance to advice, predatory, false accusations)", "values": "scale"}, "gen-day-struct_mg": {"question": "Does the person's day lack any structure?", "values": "scale"}, "gen-day-actvty-lev_mg": {"question": "What is the person's general level of activity?", "values": "nominal"}, "gen-diet-eating_mg": {"question": "Does the person fail to eat a healthy diet?", "values": "scale"}, "gen-diet-weigt-ext_mg": {"question": "Is the person's weight a cause of concern? Select the appropriate description.", "values": "nominal"}, "gen-diet-weigt-chg_mg": {"question": "Has the person experienced weight change in recent months?", "values": "scale"}, "gen-diet-drink_mg": {"question": "Does the person fail to have appropriate fluid intake (too much or too little)?", "values": "scale"}, "gen-subs-misuse_mg": {"question": "Does the person have a history of misusing drugs or alcohol?", "values": "filter-q"}, "gen-alc-misuse_mg": {"question": "Does alcohol currently have a bad effect on the person's life?", "values": "scale"}, "gen-drug-misuse_mg": {"question": "Do drugs currently have a bad effect on the person's life?", "values": "scale"}, "adv-life-event_mg": {"question": "Does the person have any adverse life events (eg suffered abuse, criminal justice proceedings, serious injury, detrimental upbringing/education, eating disorders)?", "values": "filter-q"}, "gen-life-abuse_mg": {"question": "Has the person ever been the victim of any form of abuse (eg physical, sexual, financial, emotional)?", "values": "filter-q"}, "gen-life-sex-abuse_mg": {"question": "Has the person ever been sexually abused?", "values": "filter-q"}, "gen-sex-abse-last_mg": {"question": "When was the most recent episode of sexual abuse?", "values": "date-year"}, "gen-sex-abse-as-ch_mg": {"question": "Was the first episode of sexual abuse during childhood or early adolescence?", "values": "nominal"}, "gen-phys-abse_mg": {"question": "Has the person ever been physically abused?", "values": "filter-q"}, "gen-phys-abse-last_mg": {"question": "When was the most recent episode of physical abuse?", "values": "date-month"}, "gen-phy-abse-as-ch_mg": {"question": "Was the first episode of physical abuse during childhood or early adolescence?", "values": "nominal"}, "gen-emot-abse_mg": {"question": "Has the person ever been emotionally abused due to, for example, race, religion, sexual orientation, appearance?", "values": "filter-q"}, "gen-emot-abse-last_mg": {"question": "When was the most recent episode of emotional abuse?", "values": "date-month"}, "gen-emo-abse-as-ch_mg": {"question": "Was the first episode of emotional abuse during childhood or early adolescence?", "values": "nominal"}, "gen-financial-abuse_mg": {"question": "Has the person ever been financially abused?", "values": "nominal"}, "gen-forensic-proc_mg": {"question": "Has the person ever faced serious criminal justice proceedings (court cases, custodial sentences, etc)?", "values": "filter-q"}, "gen-forensic-proc-curr_mg": {"question": "Are the serious criminal justice proceedings current?", "values": "nominal"}, "gen-env-grew-up_mg": {"question": "Did the person grow up in emotionally disturbed or disruptive environments?", "values": "scale"}, "gen-eating-dis_mg": {"question": "Has the person suffered from eating disorders in the past?", "values": "scale"}, "gen-educ-expr_mg": {"question": "Did the person have a bad time at school?", "values": "scale"}, "serious-injury_mg": {"question": "Has the person ever had a serious injury?", "values": "scale"}, "gen-presentation_mg": {"question": "Are you concerned about the person's behavioural presentation with respect to potential risks (eg verbal and physical behaviour, uneasy `gut' feeling in yourself)?", "values": "filter-q"}, "gen-engagement_mg": {"question": "Are you concerned about the person's engagement with you during the assessment?", "values": "filter-q"}, "gen-rapport_mg": {"question": "How difficult is it to have rapport with the person?", "values": "scale"}, "gen-responsve_mg": {"question": "Is the person unwilling to communicate or respond to questions?", "values": "scale"}, "gen-gut-assmnt_mg": {"question": "Do you have an uneasy 'gut' feeling about the person (eg about the person's honesty, something doesn't quite add up, something missing)?", "values": "scale"}, "gen-risk-verbal_mg": {"question": "Are you concerned about verbal indicators of risk?", "values": "filter-q"}, "gen-risk-aggrsv_mg": {"question": "How aggressive/hostile is the person's tone of voice?", "values": "scale"}, "gen-risk-upbeat_mg": {"question": "How depressed and downbeat is the person's tone of voice?", "values": "scale"}, "gen-coherence_mg": {"question": "Is the person failing to make sense (eg incoherent, irrational)?", "values": "scale"}, "gen-body-face_mg": {"question": "Are you concerned about the person's body language and expression?", "values": "filter-q"}, "gen-distrss-b-lang_mg": {"question": "Does the person's body language indicate distress?", "values": "scale"}, "gen-low-mood_mg": {"question": "Do the person's movements, posture, and facial expression indicate a low, downbeat, or gloomy mood?", "values": "scale"}, "gen-threat-move_mg": {"question": "How aggressive or threatening are the person's movements and posture?", "values": "scale"}, "gen-detached_mg": {"question": "Does the person appear detached or preoccupied?", "values": "scale"}, "gen-avoid-eye-contact_mg": {"question": "Does the person avoid eye contact?", "values": "scale"}, "gen-eye-movement_mg": {"question": "How would you describe the person's general eye movement?", "values": "nominal"}, "gen-congruence_mg": {"question": "How inconsistent are the person's physical, verbal, and emotional presentations (lack of congruence)?", "values": "scale"}, "gen-age_mg": {"question": "Date of birth", "values": "date-year"}, "gen-gender_mg": {"question": "Gender", "values": "nominal"}, "gen-marital-status_mg": {"question": "Does the person have a partner?", "values": "filter-q"}, "partner-share-acc_mg": {"question": "Does the person live with his or her partner?", "values": "nominal"}, "gen-accom-share_mg": {"question": "Does the person share the living accommodation with anyone who is not the partner?", "values": "filter-q"}, "gen-accom-depndnts_mg": {"question": "Does the person live with dependents (relatives or children)?", "values": "filter-q"}, "gen-accom-num-dep_mg": {"question": "How many dependents does the person live with", "values": "integer"}, "gen-dep-ygnst-age_mg": {"question": "What is the age of the youngest dependent?", "values": "integer"}, "gen-accm-share-nd_mg": {"question": "How many non-dependents share the living accommodation", "values": "integer"}, "gen-ethnicity_mg": {"question": "What is the person's ethnic group?", "values": "nominal"}, "mappa_mg": {"question": "Does the person have any Multi-Agency Public Protection Arrangements (MAPPA)?", "values": "nominal"}, "sh_mg": {"question": "In your judgement, what is the risk that the person will self-harm?", "values": "scale"}, "sh-specific_mg": {"question": "Do you have reason to be concerned about the person's risk of self-harming?", "values": "layer"}, "sh-past-curr-ep_mg": {"question": "Has the person ever engaged in self-harming behaviour? If yes, the questions about them should be answered with reference to the general episodes rather than any specific one, unless otherwise stated.", "values": "filter-q"}, "sh-most-rec-ep_mg": {"question": "When was the most recent self-harm episode?", "values": "date-day"}, "sh-patt-of-eps_mg": {"question": "Has there been more than one self-harm episode?", "values": "filter-q"}, "sh-first-time-ep_mg": {"question": "When was the first self-harm episode?", "values": "date-week"}, "sh-freq-eps_mg": {"question": "How often do the episodes of self-harm occur?", "values": "nominal"}, "sh-incrse-eps_mg": {"question": "Have the self-harm episodes changed in frequency over the last year?", "values": "nominal"}, "sh-hlp-after_mg": {"question": "Does the person try to hide any self-harming?", "values": "scale"}, "sh-lethality-mth_mg": {"question": "In general, how likely is it that the chosen self-harm methods could lead to death?", "values": "scale"}, "sh-change-mth_mg": {"question": "Have the self-harming methods suddenly changed?", "values": "nominal"}, "sh-for-hlp-diff_mg": {"question": "How much are the self-harming episodes more than a cry for help (driven by the underlying problem rather than trying to get help with it)", "values": "scale"}, "sh-hlp-cope-diff_mg": {"question": "Did the self-harm episodes help the person cope with difficulties?", "values": "nominal"}, "sh-pot-triggs-p_mg": {"question": "Do you have reason to be concerned about anything that could trigger self-harm?", "values": "layer"}, "sh-pot-triggs_mg": {"question": "Is the person exposed to feelings or circumstances that may trigger self-harming?", "values": "scale"}, "sh-pot-trigs-mtch_mg": {"question": "Do the person's current feelings or circumstances match those that are known to have triggered any previous episodes of self harm?", "values": "scale"}, "sh-family-hist_mg": {"question": "Has there been any history of self-harm in the person's family?", "values": "nominal"}, "sh-ideation_mg": {"question": "Is the person having self-harming thoughts or fantasies?", "values": "filter-q"}, "sh-freq-ideatn_mg": {"question": "How often do the self-harming thoughts or fantasies occur?", "values": "nominal"}, "sh-strength_mg": {"question": "How persistent, intrusive, and intense are the self-harming thoughts?", "values": "scale"}, "hto_mg": {"question": "In your judgement, what is the risk that the person will cause harm to people/animals or damage property?", "values": "scale"}, "hto-specific_mg": {"question": "Do you have reason to be concerned about the person's risk of harm to others or destructive behaviour?", "values": "layer"}, "hto-past-curr-ep_mg": {"question": "Has the person ever engaged in episodes of harm to people/animals or damage to property (fire setting, vandalism, etc)? If yes, the questions about them should be answered with reference to the attempts in general rather than any specific one, unless otherwise stated.", "values": "filter-q"}, "hto-phys-sex_mg": {"question": "Has the person ever carried out any physical or sexual assaults?", "values": "filter-q"}, "hto-any-violent_mg": {"question": "Were any of the episodes physical assaults/abuse?", "values": "filter-q"}, "hto-violent_mg": {"question": "How serious was the most severe physical assault or abuse?", "values": "scale"}, "hto-recent-violent-eps_mg": {"question": "When was the most recent episode of assault/physical abuse?", "values": "date-week"}, "hto-violent-prev-freq_mg": {"question": "How frequent are the physical assaults?", "values": "nominal"}, "hto-first-time-violent-ep_mg": {"question": "When was the first episode of assault/physical abuse?", "values": "date-month"}, "hto-any-sex-asslt_mg": {"question": "Were any of the previous assaults rape or some other form of sexual abuse?", "values": "filter-q"}, "hto-sex-asslt_mg": {"question": "Select the most serious form of sexual assault by the person?", "values": "nominal"}, "hto-recent-sexual-eps_mg": {"question": "When was the most recent episode of sexual assault?", "values": "date-week"}, "hto-sexual-prev-freq_mg": {"question": "How frequent are the episodes of sexual assault?", "values": "nominal"}, "hto-first-time-sexual-ep_mg": {"question": "When was the first episode of sexual assault?", "values": "date-month"}, "hto-weapons-hist_mg": {"question": "Did any previous episodes of harm to others involve weapons (eg guns, knives)?", "values": "nominal"}, "hto-emotional-eps_mg": {"question": "Has the person ever emotionally abused other people (including racial abuse)?", "values": "filter-q"}, "hto-emotional-ep_mg": {"question": "How serious was the emotional abuse?", "values": "scale"}, "hto-recent-emotional-eps_mg": {"question": "When was the most recent episode of emotional abuse?", "values": "date-week"}, "hto-emotional-prev-freq_mg": {"question": "How frequent are the episodes of emotional abuse?", "values": "nominal"}, "hto-first-time-emotional-ep_mg": {"question": "When was the first episode of emotional abuse?", "values": "date-month"}, "hto-any-dest-prprty_mg": {"question": "Has the person ever engaged in deliberate damage to property (excluding fire setting)?", "values": "filter-q"}, "hto-dest-prprty_mg": {"question": "How serious was the damage to property?", "values": "scale"}, "hto-recent-destructive-eps_mg": {"question": "When was the most recent deliberate damage to property?", "values": "date-week"}, "hto-destructive-prev-freq_mg": {"question": "How frequent are the episodes of damage to property?", "values": "nominal"}, "hto-first-time-destructive-ep_mg": {"question": "When was the first deliberate damage to property?", "values": "date-month"}, "hto-any-fire-setting_mg": {"question": "Has the person ever engaged in fire setting behaviour?", "values": "filter-q"}, "hto-fire-setting_mg": {"question": "How serious were the acts of fire setting?", "values": "scale"}, "hto-recent-fire-setting-eps_mg": {"question": "When was the most recent episode of fire setting?", "values": "date-week"}, "hto-fire-setting-prev-freq_mg": {"question": "How frequent are the fire-setting episodes?", "values": "nominal"}, "hto-first-time-fire-setting-ep_mg": {"question": "When was the first episode of fire setting?", "values": "date-month"}, "hto-any-to-anmls_mg": {"question": "Has the person ever abused animals?", "values": "filter-q"}, "hto-to-anmls_mg": {"question": "How serious was the animal abuse?", "values": "scale"}, "hto-recent-animal-eps_mg": {"question": "When was the most recent episode of animal abuse?", "values": "date-week"}, "hto-animal-prev-freq_mg": {"question": "How frequent are the episodes of animal abuse?", "values": "nominal"}, "hto-first-time-animal-ep_mg": {"question": "When was the first episode of animal abuse?", "values": "date-month"}, "hto-targets_mg": {"question": "Are there any particular groups of people, rather than complete strangers, that the person is known to have targeted for harm?  If yes, select all those that apply.", "values": "filter-q"}, "carers-family_mg": {"question": "Has anyone been harmed within the domestic setting?", "values": "nominal"}, "shared-accom-neighbours_mg": {"question": "Have any neighbours or people sharing your living space been harmed?", "values": "nominal"}, "friends-colleagues_mg": {"question": "Have any friends or colleagues been harmed?", "values": "nominal"}, "health-workers_mg": {"question": "Have any health workers been harmed?", "values": "nominal"}, "authority-figs_mg": {"question": "Have any authority figures been harmed?", "values": "nominal"}, "ethnic_mg": {"question": "Has anyone from a different ethnic background been harmed?", "values": "nominal"}, "hto-curr-persp-ep_mg": {"question": "Does the person believe there was nothing wrong with causing harm or damage?", "values": "scale"}, "hto-intention_mg": {"question": "Do you believe the person has an intention/plan to cause harm or damage?", "values": "layer"}, "hto-means-plan_mg": {"question": "Does the person have the means and know-how to carry out the plan for harm or damage?", "values": "scale"}, "hto-steps-plan_mg": {"question": "Has the person taken steps towards implementing the plan to harm or damage (eg made threats, monitored the victim)?", "values": "scale"}, "hto-intent-peop_mg": {"question": "Are the person's intentions directed towards people?", "values": "filter-q"}, "hto-targets-id_mg": {"question": "Has the person got any particular victims (specific individuals) in mind for harming?", "values": "nominal"}, "app-harm-dam_mg": {"question": "Does the person's appearance (not body language or behaviour) cause you concern about risk of harm or damage (eg sweating, blood, state of clothes)?", "values": "scale"}, "hto-religious_mg": {"question": "What effect do the person's spiritual/religious values or beliefs have on the risk of harm or damage?", "values": "nominal"}, "pot-trig-hto_mg": {"question": "Do you have reason to be concerned about anything that could trigger harm or damage?", "values": "layer"}, "hto-pot-trig_mg": {"question": "Is the person exposed to feelings or circumstances that could trigger episodes of harm or damage?", "values": "scale"}, "hto-pot-trig-mtch_mg": {"question": "Do the person's current feelings or circumstances match those that are known to have triggered any previous harm or damage?", "values": "scale"}, "gen-violent-purs_mg": {"question": "Does the person have an interest in pursuits related to violence (eg weapons, violent videos or computer games)?", "values": "scale"}, "hto-fam-hist_mg": {"question": "Is there a history of violence, abuse, or aggression in the person's family?", "values": "scale"}, "hto-ideation-vio_mg": {"question": "Is the person having thoughts or fantasies about harming people/animals or damaging property?", "values": "filter-q"}, "hto-hi-rsk-ideatn_mg": {"question": "Does the content of the person's thoughts or fantasies about harm or damage make it more likely he or she will do it?", "values": "scale"}, "hto-freq-ideatn_mg": {"question": "How often do the thoughts or fantasies about harm or damage occur?", "values": "nominal"}, "hto-strgth-ideatn_mg": {"question": "How persistent, intrusive, or intense are the thoughts/fantasies of harm or damage?", "values": "scale"}, "hto-ideatn-link_mg": {"question": "Do the thoughts/fantasies of harm or damage relate to the people, events, and circumstances in the person's own world (ie the realism of the thoughts)?", "values": "scale"}, "risk-dep_mg": {"question": "In your judgement, does the person put any dependents at risk (consider both children and adults)?", "values": "scale"}, "dependents-specific_mg": {"question": "Do you have reason to be concerned about the person's risk to dependents?", "values": "layer"}, "child-prot_mg": {"question": "Are there any child protection issues?", "values": "nominal"}, "sn_mg": {"question": "In your judgement, to what extent is the person failing to look after him or herself?", "values": "scale"}, "vuln-su_mg": {"question": "In your judgement, how vulnerable is the person (consider physical, emotional, sexual, and financial vulnerability)?", "values": "scale"}, "vuln-specific_mg": {"question": "Do you have reason to be concerned about the person's vulnerability?", "values": "layer"}, "falls_mg": {"question": "Does the person have a history of falls or other accidents?", "values": "filter-q"}, "recent-falls_mg": {"question": "Have any of the falls or accidents occurred recently (within the last year approximately)?", "values": "filter-q"}, "falls-reasons_mg": {"question": "Are the reasons for the falls or accidents known (eg physical health problems, hazards in the home)?", "values": "nominal"}, "frailty_mg": {"question": "Has the person ever sustained a fragility fracture (broken bone after a minor bump or fall), e.g. wrist, hip, vertebra, humerus?", "values": "nominal"}, "vuln-app-behavr_mg": {"question": "Do you have reason to be concerned about appearance or behaviour issues that may be putting the person at risk (consider physical, emotional, sexual, and financial vulnerability)?", "values": "layer"}, "app-vuln-abuse_mg": {"question": "Does the person's appearance cause you concern about abuse by others (eg bruises, scratches, blood, state of clothes)?", "values": "scale"}, "sex-vuln_mg": {"question": "Does the person's behaviour make him or her vulnerable to sexual harrassment or abuse?", "values": "scale"}, "phys-vuln_mg": {"question": "Does the person's behaviour make him or her vulnerable to physical harrassment or abuse?", "values": "scale"}, "emot-vuln_mg": {"question": "Does the person's behaviour make him or her vulnerable to emotional harrassment or abuse?", "values": "scale"}, "finan-vuln_mg": {"question": "Does the person's behaviour make him or her vulnerable to financial abuse?", "values": "scale"}, "wandering_mg": {"question": "Does the person have a history of wandering behaviour?", "values": "nominal"}, "dis-conf_mg": {"question": "Is the person confused or disorientated as a result of recent changes in circumstances (eg hospital admission, new carer)?", "values": "scale"}, "indep-living_mg": {"question": "Do you have reason to be concerned about the person's ability to live independently?", "values": "layer"}, "carers_mg": {"question": "How much does the person depend on carers?", "values": "scale"}, "gen-liv-skills_mg": {"question": "Does the person lack the ability to look after daily living requirements (cooking, shopping, cleaning, etc)?", "values": "scale"}, "generic_mg": {"question": "These questions are not about specific risks but there are some that may help assess the patient if you have not already decided what to do. Do you wish to answer them now?", "values": ""}}