{
    "hto_mg": "Its unnecessary",
    "hto_specific_mg": "Do you have reason to be concerned about the persons risk of harm to others or destructive behaviour?",
    "hto_past_curr_ep_mg": "Has the person ever engaged in episodes of harm to people/animals or damage to property (fire setting, vandalism, etc)? If yes, the questions about them should be answered with reference to the attempts in general rather than any specific one, unless otherwise stated.",
    "hto_targets_mg": "Are there any particular groups of people, rather than complete strangers, that the person is known to have targeted for harm? If yes, select all those that apply.",
    "carers_family_mg": "carers or family? Yes/no",
    "shared_accom_neighboors_mg": "neighbours or people sharing living space? Yes/no",
    "friends_peers_mg": "friends or colleagues? Yes/no",
    "health_workers_mg": "health workers? Yes/no",
    "authority_figd_mg": "authority figures? Yes/no",
    "ethnic_mg": "those from a different ethnic background? Yes/no",
    "hto_type_mg": "Its unnecessary",
    "hto_phys_sex_mg": "Has the person ever carried out any physical or sexual assaults? Yes/No",
    "hto_any_violent_mg": "Were any of the episodes physical assaults/abuse? Yes/No",
    "hto_violent_mg": "How serious was the most severe physical assault or abuse?",
    "hto_recent_violent_eps_mg": "When was the most recent episode of assault/physical abuse?",
    "hto_violent_prev_freq_mg": "How frequent are the physical assaults?",
    "hto_first_time_violent_ep_mg": "When was the first episode of assault/physical abuse?",
    "hto_any_sex_asslt_mg": "Were any of the previous assaults rape or some other form of sexual abuse?",
    "hto_sex_asslt_mg": "Select the most serious form of sexual assault by the person?",
    "hto_recent_sexual_eps_mg": "When was the most recent episode of sexual assault? ",
    "hto_sexual_prev_freq_mg": "How frequent are the episodes of sexual assault?",
    "hto_first_time_sexual_ep_mg": "When was the first episode of sexual assault?",
    "hto_weapons_hist_mg": "Did any previous episodes of harm to others involve weapons? Yes/no",
    "hto_emotional_eps_mg": "Has the person ever emotionally abused other people (including racial abuse)? Yes/no",
    "hto_emotional_ep_mg": "How serious was the emotional abuse? ",
    "hto_recent_emotional_eps_mg": "When was the most recent episode of emotional abuse?",
    "hto_emotional_prev_freq_mg": "How frequent are the episodes of emotional abuse? ",
    "hto_first_time_emotional_ep_mg": "When was the first episode of emotional abuse?",
    "hto_any_dest_prprty_mg": "Has the person ever engaged in deliberate damage to property (excluding fire setting)? Yes/no",
    "hto_dest_prprty_mg": "How serious was the damage to property?",
    "hto_recent_destructive_eps_mg": "When was the most recent deliberate damage to property?",
    "hto_destructive_prev_freq_mg": "How frequent are the episodes of damage to property?",
    "hto_first_time_destructive_ep_mg": "When was the first deliberate damage to property?",
    "hto_any_fire_setting_mg": "Has the person ever engaged in fire setting behaviour? Yes/no",
    "hto_fire_setting_mg": "How serious were the acts of fire setting?",
    "hto_recent_fire_setting_eps_mg": "When was the most recent episode of fire setting?",
    "hto_fire_setting_prev_freq_mg": "How frequent are the fire-setting episodes?",
    "hto_first_time_fire_setting_ep_mg": "When was the first episode of fire setting?",
    "hto_any_to_anmls_mg": "Has the person ever abused animals? Yes/No",
    "hto_to_anmls_mg": "How serious was the animal abuse?",
    "hto_recent_animal_eps_mg": "When was the most recent episode of animal abuse?",
    "hto_animal_prev_freq_mg": "How frequent are the episodes of animal abuse?",
    "hto_first_time_animal_ep_mg": "When was the first episode of animal abuse?",
    "hto_curr_persp_ep_mg": "Does the person believe there was nothing wrong with causing harm or damage?",
    "harm_dam_curr_sit_behav_mg": "Its Unnecessary",
    "hto_intention_mg": "Do you believe the person has an intention/plan to cause harm or damage? Yes/No",
    "hto_means_plan_mg": "Does the person have the means and know-how to carry out the plan for harm or damage?",
    "hto_steps_plan_mg": "Has the person taken steps towards implementing the plan to harm or damage (eg made threats, monitored the victim)?",
    "hto_targets_id_mg": "Are the persons intentions directed towards people? Yes/No",
    "app_harm_dan_mg": "Does the persons appearance (not body language or behaviour) cause you concern about risk of harm or damage (eg sweating, blood, state of clothes)?",
    "hto_religious_mg": "What effect do the persons spiritual/religious values or beliefs have on the risk of harm or damage?",
    "pot_trig_hto_mg": "Do you have reason to be concerned about anything that could trigger harm or damage? Yes/No",
    "hto_pot_trig_mg": "Is the person exposed to feelings or circumstances that could trigger episodes of harm or damage?",
    "hto_pot_trig_mtch_mg": "Do the persons current feelings or circumstances match those that are known to have triggered any previous harm or damage?",
    "gen_violent_purs_mg": "Does the person have an interest in pursuits related to violence (eg weapons, violent videos or computer games)?",
    "hto_fam_hist_mg": "Is there a history of violence, abuse, or aggression in the persons family?",
    "hto_ideation_vio_mg": "Is the person having thoughts or fantasies about harming people/animals or damaging property? Yes/No",
    "hto_strgth_ideatn_mg": "How persistent, intrusive, or intense are the thoughts/fantasies of harm or damage?",
    "hto_hi_risk_ideatn_mg": "Does the content of the persons thoughts or fantasies about harm or damage make it more likely he or she will do it?",
    "hto_freq_ideatn_mg": "How often do the thoughts or fantasies about harm or damage occur?",
    "hto_ideatn_link_mg": "Do the thoughts/fantasies of harm or damage relate to the people, events, and circumstances in the persons own world (ie the realism of the thoughts)?",
    "gen_state_mind_mg": "Its unnecessary",
    "gen_feel_emot_mg": "Do you have reason to be concerned about risks due to the persons feelings/emotions? Yes/no",
    "gen_mood_swings_mg": "Does the person have sudden mood changes or swings?",
    "gen_negative_self_mg": "Does the person have negative feelings about him or herself (eg self-hatred, guilt, shame, humiliation)?",
    "gen_hopeless_mg": "Does the person think life is not worth living?",
    "gen_life_not_living_mg": "Does the person lack any plans for the future?",
    "gen_plans_future_mg": "Does the person lack any plans for the future?",
    "gen_angry_emotns_mg": "Is the person displaying anger?",
    "gen_anx_emotns_mg": "Is the person anxious or fearful?",
    "gen_helpless_mg": "Does the person feel helpless?",
    "gen_sad_mg": "Is the person feeling sad or low?",
    "gen_distress_mg": "Is the person distressed?",
    "gen_jealous_mg": "Is the person feeling jealous?",
    "gen_self_worth_p_mg": "Do you have reason to be concerned about risks due to the persons sense of self worth?",
    "worthlessness_mg": "Does the person regard him or herself as worthless?",
    "grandiosity_mg": "Does the person feel special and able to control everything?",
    "gen_person_thinking_mg": "Its unnecessary",
    "gen_personality_mg": "Do you have reason to be concerned about personality factors and their impact on risks?",
    "gen_impulse_mg": "How impulsive is the person?",
    "gen_assertive_mg": "How assertive is the person?",
    "gen_empathy_abil_mg": "Does the person lack empathy?",
    "gen_dependence_mg": "Is the person overdependent (weak, over-reliant on others, easily influenced, unable to function independently)?",
    "gen_controlling_mg": "How organised is the persons general approach to life?",
    "gen_coping_abit_mg": "Does the person lack the ability to cope with major life stresses?",
    "gen_hostile_mg": "How hostile is the person?",
    "gen_reliable_mg": "How unreliable is the person (eg untrustworthy or unpredictable)?",
    "ment_fac_mg": "Does the person have a diagnosed personality disorder? Yes/No",
    "gen_autism_mg": "Its unnecessary",
    "gen_impaird_cog_mg": "Is there any impaired cognitive function (thinking processes, memory, concentration) or dementia? Yes/No",
    "gen_cog_think_mem_mg": "Have the thinking processes and memory recently got worse?",
    "gen_concentr_mg": "Is the person able to concentrate?",
    "gen_learn_disab_mg": "Do you believe the person has learning disabilities?",
    "insight_resp_mg": "Do you have reason to be concerned about the persons lack of insight and sense of responsibility? Yes/No",
    "gen_insight_behvr_mg": "Insight behaviour",
    "gen_resp_impct_oth_mg": "Impact of others",
    "gen_nd_hip_diff_mg": "Difference",
    "gen_health_care_mg": "Healthcare",
    "mental_health_mg": "Mental health",
    "clin_depression_mg": "Clinical depression",
    "gen_dep_stage_mg": "Depression stage",
    "gen_mntl_cur_sympt_mg": "Is the person currently suffering from mania, hallucinations, or delusions?",
    "gen_voice_hal_mg": "Does the person hear voices that are not present in reality?",
    "gen_prob_act_voice_mg": "Will the person act on the voices?",
    "gen_voices_type_mg": "Voice type?",
    "gen_voice_dang_s_mg": "How much do the voices urge the person to harm or endanger him/herself?",
    "gen_voice_dang_o_mg": "How much do the voices urge the person to harm/endanger other people?",
    "gen_paranoid_del_mg": "Does the person suffer from delusions (ie clearly incorrect and illogical ideas about his or her life and circumstances)?",
    "gen_prob_act_par_del_mg": "How likely is it that the person will act on any delusions?",
    "gen_type_paranoid_del_mg": "Is the person obsessed about the perceived bad behaviour of particular known people?",
    "gen_paran_del_spec_mg": "Is the person obsessed about being harmed or persecuted by particular known people?",
    "gen_paran_del_pers_mg": "Is the person displaying manic or hypomanic behaviour (fast speech, excessive irritability, recklessness, impulsivity, etc)?",
    "gen_mania_mg": "Is the person currently suffering from mania, hallucinations, or delusions?",
    "gen_phys_hlth_prb_mg": "Do you have reason to be concerned about risks due to any physical health problems? Yes/No",
    "gen_chronic_disease_mg": "Does the person suffer from any chronic health conditions? Yes/No",
    "tinnitus_mg": "Tinnitus?",
    "diabetes_mg": "Diabetes",
    "multiple_sclerosis_mg": "Multiple sclerosis",
    "asthma_mg": "Asthma",
    "heart_disease_mg": "Heart disease",
    "kidney_disease_mg": "Kidney disease",
    "lung_disease_mg": "lung disease",
    "arthritis_mg": "arthritis",
    "high_blood_pressure_mg": "high blood pressure",
    "other_mg": "Any other condition",
    "gen_phys_hlth_deg_diag_mg": "If the person has a life-threatening or degenerative illness (eg cancer, multiple sclerosis, Parkinsons, emphysema, HIV), when was it first diagnosed?",
    "gen_phys_hlth_pain_mg": "If the person suffers from chronic or periodic pain, how bad is it? ",
    "gen_phys_htth_disa_mg": "Does the person suffer from problems that affect mobility and/or dexterity (eg eyesight, balance, disability due to disease or trauma)?",
    "gen_com_imp_mg": "Does the person have trouble communicating as a result of physical health problems (eg hearing, speech)?",
    "gen_phys_hlth_det_mg": "Has the persons physical health got worse over the last few months, including temporary or repeating problems?",
    "gen_meds_therpy_mg": "Do you have reason to be concerned about the persons concordance with health treatment? Yes/No",
    "gen_meds_concord_mg": "Is the person failing to concord with medication or therapies, either deliberately or due to multiple medications, for example?",
    "gen_serv_perc_supp_mg": "Does the person think health or social care services are not supportive?",
    "gen_med_perc_benft_mg": "Does the person and/or carer think any medication/therapies are not working properly?",
    "gen_involve_social_mg": "Its unnecessary",
    "motive_eng_mg": "Do you have motivation engagement?",
    "gen_eng_world_mg": "Do you have reason to be concerned about the persons motivation and engagement with the world? Yes/No",
    "gen_phys_withd_mg": "Is the person physically isolated from the world?",
    "gen_mental_withd_mg": "Has the person mentally disengaged or withdrawn from the world?",
    "gen_motivation_mg": "Does the person lack motivation in general life?",
    "gen_listless_mg": "Its unnecessary",
    "gen_soc_contxt_mg": "Do you have reason to be concerned about risks due to the persons social context",
    "gen_relatnshps_mg": "relationships",
    "gen_net_relat_mg": "Do you have reason to be concerned about risks due to the persons current relationships?",
    "gen_relat_nature_mg": "Does the person lack a good network of relationships outside the home?",
    "gen_relat_supp_mg": "Does the person lack supportive relationships?",
    "gen_relat_detr_yng_mg": "Does the person have detrimental relationships (eg bullied, over-protected) or ones with people who have antisocial behaviours or who take advantage of the person",
    "bullied_mg": "Bullied",
    "gangs_mg": "Gangs",
    "gen_relat_detr_chg_mg": "Does the person think important relationships have changed for the worse or soon will do (eg divorce, separation, rows, carers role, bereavement)?",
    "gen_living_arr_mg": "Do you have reason to be concerned about risks due to the persons living arrangements? Yes/No",
    "gen_move_freq_mg": "How often does the persons living place change?",
    "gen_home_type_mg": "What type of supported living does the person have?",
    "gen_neighbrhd_mg": "Does the neighbourhood or care environment increase the persons particular risks (eg violent, easy access to drugs and unhelpful temptations)?",
    "gen_isol_accom_mg": "Isolated accommodation",
    "gen_neighbrhd_rsky_mg": "Risky neighborhood",
    "gen_accom_state_mg": "Accommodation state",
    "gen_accom_hm_care_mg": "Accommodation home care",
    "gen_accom_habitbl_mg": "Accommodation habitual living",
    "gen_currnt_bhvr_mg": "Do you have reason to be concerned about the persons general current behaviour (eg risk-taking, sleep patterns, daily activities, challenging behaviour)?",
    "gen_rsk_bhvr_mg": "Does the person take reckless risks (eg with sexual behaviour, driving, gambling and other leisure pursuits)?",
    "gen_unint_risk_behavr_mg": "Does the persons behaviour lead to unintentional risks (eg fire or harm due to being careless, thoughtless or forgetful; self-injurious behaviour)?",
    "gen_sleep_dist_mg": "Does the person experience problems with sleeping?",
    "gen_unusl_rec_bhvr_mg": "Has the person been behaving out of character or unpredictably in recent weeks?",
    "gen_chall_bhvr_mg": "Does the person display challenging behaviour (eg antisocial, disruptive, resistance to advice, predatory, false accusations)",
    "gen_day_actvty_mg": "Is the person daily active?",
    "gen_day_struct_mg": "Does the persons day lack any structure?",
    "gen_day_actvty_lev_mg": "What is the persons general level of activity?",
    "gen_app_diet_mg": "Its unnecessary",
    "gen_diet_eating_mg": "Does the person fail to eat a healthy diet?",
    "gen_diet_weight_mg": "Weight changes",
    "gen_diet_weigt_ext_mg": "Extremely weight changes",
    "gen_diet_weigt_chg_mg": "Has the person experienced weight change in recent months?",
    "gen_diet_drink_mg": "Does the person fail to have appropriate fluid intake (too much or too little)?",
    "gen_subs_misuse_mg": "Does the person have a history of misusing substances?",
    "gen_alc_misuse_mg": "Does the person have a history of misusing alcohol?",
    "gen_drug_misuse_mg": "Does the person have a history of misusing drugs?",
    "adv_life_event_mg": "Does the person have any adverse life events (eg suffered abuse, criminal justice proceedings, serious injury, detrimental upbringing/education, eating disorders)? Yes/No",
    "gen_life_abuse_mg": "Has the person ever been the victim of any form of abuse (eg physical, sexual, financial, emotional)? Yes/No",
    "gen_life_sex_abuse_mg": "Has the person ever been sexually abused? Yes/No",
    "gen_sex_abse_last_mg": "When was the most recent episode of sexual abuse?",
    "gen_phys_abse_mg": "Has the person ever been physically abused?",
    "gen_phys_abse_last_mg": "When was the most recent episode of physical abuse?",
    "gen_emot_abse_mg": "Has the person ever been emotionally abused due to, for example, race, religion, sexual orientation, appearance?",
    "gen_emot_abse_last_mg": "When was the most recent episode of emotional abuse?",
    "gen_financial_abuse_mg": "Has the person ever been financially abused?",
    "gen_neg_his_mg": "Neglect",
    "other_chall_exp_mg": "Other challenging experiences",
    "gen_forensic_proc_mg": "Has the person ever faced serious criminal justice proceedings (court cases, custodial sentences, etc)? Yes/No",
    "gen_forensic_proc_curr_mg": "Are the serious criminal justice proceedings current? Yes/No",
    "gen_env_grew_up_mg": "Did the person grow up in emotionally disturbed or disruptive environments?",
    "family_ment_hlth_mg": "Its unnecessary",
    "gen_eating_dis_mg": "Has the person suffered from eating disorders in the past?",
    "serious_injury_mg": "Has the person ever had a serious injury?",
    "gen_presentation_mg": "Are you concerned about the persons behavioural presentation with respect to potential risks (eg verbal and physical behaviour, uneasy gut feeling in yourself)? Yes/No",
    "gen_engagement_mg": "Are you concerned about the persons engagement with you during the assessment? Yes/No",
    "gen_rapport_mg": "How difficult is it to have rapport with the person?",
    "gen_responsve_mg": "Is the person unwilling to communicate or respond to questions?",
    "gen_gut_assmnt_mg": "Do you have an uneasy gut feeling about the person (eg about the persons honesty, something doesnt quite add up, something missing)?",
    "gen_risk_verbal_mg": "Are you concerned about verbal indicators of risk? Yes/No",
    "gen_risk_tone_mg": "Are you concerned about persons tone of voice?",
    "gen_risk_aggrsv_mg": "How aggressive/hostile is the persons tone of voice?",
    "gen_risk_upbeat_mg": "How depressed and downbeat is the persons tone of voice?",
    "gen_coherence_mg": "Is the person failing to make sense (eg incoherent, irrational)?",
    "gen_body_face_mg": "Are you concerned about the persons body language and expression?",
    "gen_distrss_b_lang_mg": "Does the persons body language indicate distress?",
    "gen_low_mood_mg": "Do the persons movements, posture, and facial expression indicate a low, downbeat, or gloomy mood?",
    "gen_threat_move_mg": "How aggressive or threatening are the persons movements and posture?",
    "gen_detached_mg": "Does the person appear detached or preoccupied?",
    "gen_eyes_mg": "Its unnecessary",
    "gen_avoid_eye_contact_mg": "Does the person avoid eye contact?",
    "gen_eye_movement_mg": "How would you describe the persons general eye movement?",
    "gen_congruence_mg": "How inconsistent are the persons physical, verbal, and emotional presentations (lack of congruence)?",
    "gen_demog_mg": "Its unnecessary",
    "gen_age_mg": "Date of birth",
    "gen_gender_mg": "Gender",
    "gen_accom_share_mg": "Does the person share the living accommodation with anyone who is not the partner?",
    "gen_accm_num_share_non_par_mg": "How many dependents does the person live with",
    "gen_accm_who_share_non_par_mg": "How many non-dependents share the living accommodation",
    "siblings_mg": "Siblings",
    "friends_communal_mg": "Communal friends",
    "relatives_mg": "Does the person live with dependents (relatives or children)?",
    "lodgers_mg": "Lodgers",
    "others_mg": "Other ",
    "gen_ethnicity_mg": "Does the person have any Multi-Agency Public Protection Arrangements (MAPPA)"
}